zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/include/stm32mp1xx_hal_spi.h
    uint8_t                    *pTxBuffPtr;                  /*!< Pointer to SPI Tx transfer Buffer        */

    uint16_t                   TxXferSize;                   /*!< SPI Tx Transfer size                     */

    __IO uint16_t              TxXferCount;                  /*!< SPI Tx Transfer Counter                  */

    uint8_t                    *pRxBuffPtr;                  /*!< Pointer to SPI Rx transfer Buffer        */

    uint16_t                   RxXferSize;                   /*!< SPI Rx Transfer size                     */

    __IO uint16_t              RxXferCount;                  /*!< SPI Rx Transfer Counter                  */

    uint32_t                   CRCSize;                      /*!< SPI CRC size used for the transfer       */

    void (*RxISR)(struct __SPI_HandleTypeDef *hspi);         /*!< function pointer on Rx ISR               */

    void (*TxISR)(struct __SPI_HandleTypeDef *hspi);         /*!< function pointer on Tx ISR               */

    DMA_HandleTypeDef          *hdmatx;                      /*!< SPI Tx DMA Handle parameters             */

    DMA_HandleTypeDef          *hdmarx;                      /*!< SPI Rx DMA Handle parameters             */

    HAL_LockTypeDef            Lock;                         /*!< Locking object                           */

    __IO HAL_SPI_StateTypeDef  State;                        /*!< SPI communication state                  */

    __IO uint32_t              ErrorCode;                    /*!< SPI Error code                           */

#if (USE_HAL_SPI_REGISTER_CALLBACKS == 1U)
  void (* TxCpltCallback)(struct __SPI_HandleTypeDef *hspi);       /*!< SPI Tx Completed callback          */
  void (* RxCpltCallback)(struct __SPI_HandleTypeDef *hspi);       /*!< SPI Rx Completed callback          */
  void (* TxRxCpltCallback)(struct __SPI_HandleTypeDef *hspi);     /*!< SPI TxRx Completed callback        */
  void (* TxHalfCpltCallback)(struct __SPI_HandleTypeDef *hspi);   /*!< SPI Tx Half Completed callback     */
  void (* RxHalfCpltCallback)(struct __SPI_HandleTypeDef *hspi);   /*!< SPI Rx Half Completed callback     */
  void (* TxRxHalfCpltCallback)(struct __SPI_HandleTypeDef *hspi); /*!< SPI TxRx Half Completed callback   */
  void (* ErrorCallback)(struct __SPI_HandleTypeDef *hspi);        /*!< SPI Error callback                 */
  void (* AbortCpltCallback)(struct __SPI_HandleTypeDef *hspi);    /*!< SPI Abort callback                 */
  void (* MspInitCallback)(struct __SPI_HandleTypeDef *hspi);      /*!< SPI Msp Init callback              */
  void (* MspDeInitCallback)(struct __SPI_HandleTypeDef *hspi);    /*!< SPI Msp DeInit callback            */

#endif  /* USE_HAL_SPI_REGISTER_CALLBACKS */
} SPI_HandleTypeDef;

#if (USE_HAL_SPI_REGISTER_CALLBACKS == 1UL)
/**
  * @brief  HAL SPI Callback ID enumeration definition
  */
typedef enum
{
  HAL_SPI_TX_COMPLETE_CB_ID             = 0x00UL,    /*!< SPI Tx Completed callback ID         */
  HAL_SPI_RX_COMPLETE_CB_ID             = 0x01UL,    /*!< SPI Rx Completed callback ID         */
  HAL_SPI_TX_RX_COMPLETE_CB_ID          = 0x02UL,    /*!< SPI TxRx Completed callback ID       */
  HAL_SPI_TX_HALF_COMPLETE_CB_ID        = 0x03UL,    /*!< SPI Tx Half Completed callback ID    */
  HAL_SPI_RX_HALF_COMPLETE_CB_ID        = 0x04UL,    /*!< SPI Rx Half Completed callback ID    */
  HAL_SPI_TX_RX_HALF_COMPLETE_CB_ID     = 0x05UL,    /*!< SPI TxRx Half Completed callback ID  */
  HAL_SPI_ERROR_CB_ID                   = 0x06UL,    /*!< SPI Error callback ID                */
  HAL_SPI_ABORT_CB_ID                   = 0x07UL,    /*!< SPI Abort callback ID                */
  HAL_SPI_MSPINIT_CB_ID                 = 0x08UL,    /*!< SPI Msp Init callback ID             */
  HAL_SPI_MSPDEINIT_CB_ID               = 0x09UL     /*!< SPI Msp DeInit callback ID           */

} HAL_SPI_CallbackIDTypeDef;

/**
  * @brief  HAL SPI Callback pointer definition
  */
typedef  void (*pSPI_CallbackTypeDef)(SPI_HandleTypeDef *hspi); /*!< pointer to an SPI callback function */

#endif /* USE_HAL_SPI_REGISTER_CALLBACKS */
/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/

/** @defgroup SPI_Exported_Constants SPI Exported Constants
  * @{
  */

/** @defgroup SPI_FIFO_Type SPI FIFO Type
  * @{
  */
#define SPI_LOWEND_FIFO_SIZE            8UL
#define SPI_HIGHEND_FIFO_SIZE           16UL
/**
  * @}
  */

/** @defgroup SPI_Error_Code SPI Error Codes
  * @{
  */
#define HAL_SPI_ERROR_NONE              (0x00000000UL)   /*!< No error                               */
#define HAL_SPI_ERROR_MODF              (0x00000001UL)   /*!< MODF error                             */
#define HAL_SPI_ERROR_CRC               (0x00000002UL)   /*!< CRC error                              */
#define HAL_SPI_ERROR_OVR               (0x00000004UL)   /*!< OVR error                              */
#define HAL_SPI_ERROR_FRE               (0x00000008UL)   /*!< FRE error                              */
#define HAL_SPI_ERROR_DMA               (0x00000010UL)   /*!< DMA transfer error                     */
#define HAL_SPI_ERROR_FLAG              (0x00000020UL)   /*!< Error on RXNE/TXE/BSY/FTLVL/FRLVL Flag */
#define HAL_SPI_ERROR_ABORT             (0x00000040UL)   /*!< Error during SPI Abort procedure       */
#define HAL_SPI_ERROR_UDR               (0x00000080UL)   /*!< Underrun error                         */
#define HAL_SPI_ERROR_TIMEOUT           (0x00000100UL)   /*!< Timeout error                          */
#define HAL_SPI_ERROR_UNKNOW            (0x00000200UL)   /*!< Unknow error                           */
#define HAL_SPI_ERROR_NOT_SUPPORTED     (0x00000400UL)   /*!< Requested operation not supported      */
#if (USE_HAL_SPI_REGISTER_CALLBACKS == 1UL)
#define HAL_SPI_ERROR_INVALID_CALLBACK  (0x00000800UL)   /*!< Invalid Callback error                 */
#endif /* USE_HAL_SPI_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @defgroup SPI_Mode SPI Mode
  * @{
  */
#define SPI_MODE_SLAVE                  (0x00000000UL)
#define SPI_MODE_MASTER                 SPI_CFG2_MASTER
/**
  * @}
  */

/** @defgroup SPI_Direction SPI Direction Mode
  * @{
  */
#define SPI_DIRECTION_2LINES            (0x00000000UL)
#define SPI_DIRECTION_2LINES_TXONLY     SPI_CFG2_COMM_0
#define SPI_DIRECTION_2LINES_RXONLY     SPI_CFG2_COMM_1
#define SPI_DIRECTION_1LINE             SPI_CFG2_COMM
/**
  * @}
  */

/** @defgroup SPI_Data_Size SPI Data Size
  * @{
  */
#define SPI_DATASIZE_4BIT               (0x00000003UL)
#define SPI_DATASIZE_5BIT               (0x00000004UL)
#define SPI_DATASIZE_6BIT               (0x00000005UL)
#define SPI_DATASIZE_7BIT               (0x00000006UL)
#define SPI_DATASIZE_8BIT               (0x00000007UL)
#define SPI_DATASIZE_9BIT               (0x00000008UL)
#define SPI_DATASIZE_10BIT              (0x00000009UL)
#define SPI_DATASIZE_11BIT              (0x0000000AUL)
#define SPI_DATASIZE_12BIT              (0x0000000BUL)
#define SPI_DATASIZE_13BIT              (0x0000000CUL)
#define SPI_DATASIZE_14BIT              (0x0000000DUL)
#define SPI_DATASIZE_15BIT              (0x0000000EUL)
#define SPI_DATASIZE_16BIT              (0x0000000FUL)
#define SPI_DATASIZE_17BIT              (0x00000010UL)
#define SPI_DATASIZE_18BIT              (0x00000011UL)
#define SPI_DATASIZE_19BIT              (0x00000012UL)
#define SPI_DATASIZE_20BIT              (0x00000013UL)
#define SPI_DATASIZE_21BIT              (0x00000014UL)
#define SPI_DATASIZE_22BIT              (0x00000015UL)
#define SPI_DATASIZE_23BIT              (0x00000016UL)
#define SPI_DATASIZE_24BIT              (0x00000017UL)
#define SPI_DATASIZE_25BIT              (0x00000018UL)
#define SPI_DATASIZE_26BIT              (0x00000019UL)
#define SPI_DATASIZE_27BIT              (0x0000001AUL)
#define SPI_DATASIZE_28BIT              (0x0000001BUL)
#define SPI_DATASIZE_29BIT              (0x0000001CUL)
#define SPI_DATASIZE_30BIT              (0x0000001DUL)
#define SPI_DATASIZE_31BIT              (0x0000001EUL)
#define SPI_DATASIZE_32BIT              (0x0000001FUL)
/**
  * @}
  */

/** @defgroup SPI_Clock_Polarity SPI Clock Polarity
  * @{
  */
#define SPI_POLARITY_LOW                (0x00000000UL)
#define SPI_POLARITY_HIGH               SPI_CFG2_CPOL
/**
  * @}
  */

/** @defgroup SPI_Clock_Phase SPI Clock Phase
  * @{
  */
#define SPI_PHASE_1EDGE                 (0x00000000UL)
#define SPI_PHASE_2EDGE                 SPI_CFG2_CPHA
/**
  * @}
  */

/** @defgroup SPI_Slave_Select_Management SPI Slave Select Management
  * @{
  */
#define SPI_NSS_SOFT                    SPI_CFG2_SSM
#define SPI_NSS_HARD_INPUT              (0x00000000UL)
#define SPI_NSS_HARD_OUTPUT             SPI_CFG2_SSOE
/**
  * @}
  */

/** @defgroup SPI_NSSP_Mode SPI NSS Pulse Mode
  * @{
  */
#define SPI_NSS_PULSE_DISABLE           (0x00000000UL)
#define SPI_NSS_PULSE_ENABLE            SPI_CFG2_SSOM
/**
  * @}
  */

