zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/include/stm32mp1xx_hal_spi.h
/** @defgroup SPI_BaudRate_Prescaler SPI BaudRate Prescaler
  * @{
  */
#define SPI_BAUDRATEPRESCALER_2         (0x00000000UL)
#define SPI_BAUDRATEPRESCALER_4         (0x10000000UL)
#define SPI_BAUDRATEPRESCALER_8         (0x20000000UL)
#define SPI_BAUDRATEPRESCALER_16        (0x30000000UL)
#define SPI_BAUDRATEPRESCALER_32        (0x40000000UL)
#define SPI_BAUDRATEPRESCALER_64        (0x50000000UL)
#define SPI_BAUDRATEPRESCALER_128       (0x60000000UL)
#define SPI_BAUDRATEPRESCALER_256       (0x70000000UL)
/**
  * @}
  */

/** @defgroup SPI_MSB_LSB_Transmission SPI MSB LSB Transmission
  * @{
  */
#define SPI_FIRSTBIT_MSB                (0x00000000UL)
#define SPI_FIRSTBIT_LSB                SPI_CFG2_LSBFRST
/**
  * @}
  */

/** @defgroup SPI_TI_Mode SPI TI Mode
  * @{
  */
#define SPI_TIMODE_DISABLE              (0x00000000UL)
#define SPI_TIMODE_ENABLE               SPI_CFG2_SP_0
/**
  * @}
  */

/** @defgroup SPI_CRC_Calculation SPI CRC Calculation
  * @{
  */
#define SPI_CRCCALCULATION_DISABLE      (0x00000000UL)
#define SPI_CRCCALCULATION_ENABLE       SPI_CFG1_CRCEN
/**
  * @}
  */

/** @defgroup SPI_CRC_length SPI CRC Length
  * @{
  */
#define SPI_CRC_LENGTH_DATASIZE         (0x00000000UL)
#define SPI_CRC_LENGTH_4BIT             (0x00030000UL)
#define SPI_CRC_LENGTH_5BIT             (0x00040000UL)
#define SPI_CRC_LENGTH_6BIT             (0x00050000UL)
#define SPI_CRC_LENGTH_7BIT             (0x00060000UL)
#define SPI_CRC_LENGTH_8BIT             (0x00070000UL)
#define SPI_CRC_LENGTH_9BIT             (0x00080000UL)
#define SPI_CRC_LENGTH_10BIT            (0x00090000UL)
#define SPI_CRC_LENGTH_11BIT            (0x000A0000UL)
#define SPI_CRC_LENGTH_12BIT            (0x000B0000UL)
#define SPI_CRC_LENGTH_13BIT            (0x000C0000UL)
#define SPI_CRC_LENGTH_14BIT            (0x000D0000UL)
#define SPI_CRC_LENGTH_15BIT            (0x000E0000UL)
#define SPI_CRC_LENGTH_16BIT            (0x000F0000UL)
#define SPI_CRC_LENGTH_17BIT            (0x00100000UL)
#define SPI_CRC_LENGTH_18BIT            (0x00110000UL)
#define SPI_CRC_LENGTH_19BIT            (0x00120000UL)
#define SPI_CRC_LENGTH_20BIT            (0x00130000UL)
#define SPI_CRC_LENGTH_21BIT            (0x00140000UL)
#define SPI_CRC_LENGTH_22BIT            (0x00150000UL)
#define SPI_CRC_LENGTH_23BIT            (0x00160000UL)
#define SPI_CRC_LENGTH_24BIT            (0x00170000UL)
#define SPI_CRC_LENGTH_25BIT            (0x00180000UL)
#define SPI_CRC_LENGTH_26BIT            (0x00190000UL)
#define SPI_CRC_LENGTH_27BIT            (0x001A0000UL)
#define SPI_CRC_LENGTH_28BIT            (0x001B0000UL)
#define SPI_CRC_LENGTH_29BIT            (0x001C0000UL)
#define SPI_CRC_LENGTH_30BIT            (0x001D0000UL)
#define SPI_CRC_LENGTH_31BIT            (0x001E0000UL)
#define SPI_CRC_LENGTH_32BIT            (0x001F0000UL)
/**
  * @}
  */

/** @defgroup SPI_Fifo_Threshold SPI Fifo Threshold
  * @{
  */
#define SPI_FIFO_THRESHOLD_01DATA       (0x00000000UL)
#define SPI_FIFO_THRESHOLD_02DATA       (0x00000020UL)
#define SPI_FIFO_THRESHOLD_03DATA       (0x00000040UL)
#define SPI_FIFO_THRESHOLD_04DATA       (0x00000060UL)
#define SPI_FIFO_THRESHOLD_05DATA       (0x00000080UL)
#define SPI_FIFO_THRESHOLD_06DATA       (0x000000A0UL)
#define SPI_FIFO_THRESHOLD_07DATA       (0x000000C0UL)
#define SPI_FIFO_THRESHOLD_08DATA       (0x000000E0UL)
#define SPI_FIFO_THRESHOLD_09DATA       (0x00000100UL)
#define SPI_FIFO_THRESHOLD_10DATA       (0x00000120UL)
#define SPI_FIFO_THRESHOLD_11DATA       (0x00000140UL)
#define SPI_FIFO_THRESHOLD_12DATA       (0x00000160UL)
#define SPI_FIFO_THRESHOLD_13DATA       (0x00000180UL)
#define SPI_FIFO_THRESHOLD_14DATA       (0x000001A0UL)
#define SPI_FIFO_THRESHOLD_15DATA       (0x000001C0UL)
#define SPI_FIFO_THRESHOLD_16DATA       (0x000001E0UL)
/**
  * @}
  */

/** @defgroup SPI_CRC_Calculation_Initialization_Pattern SPI CRC Calculation Initialization Pattern
  * @{
  */
#define SPI_CRC_INITIALIZATION_ALL_ZERO_PATTERN       (0x00000000UL)
#define SPI_CRC_INITIALIZATION_ALL_ONE_PATTERN        (0x00000001UL)
/**
  * @}
  */

/** @defgroup SPI_NSS_Polarity SPI NSS Polarity
  * @{
  */
#define SPI_NSS_POLARITY_LOW                          (0x00000000UL)
#define SPI_NSS_POLARITY_HIGH                          SPI_CFG2_SSIOP
/**
  * @}
  */

/** @defgroup SPI_Master_Keep_IO_State Keep IO State
  * @{
  */
#define SPI_MASTER_KEEP_IO_STATE_DISABLE              (0x00000000UL)
#define SPI_MASTER_KEEP_IO_STATE_ENABLE               SPI_CFG2_AFCNTR
/**
  * @}
  */

/** @defgroup SPI_IO_Swap Control SPI IO Swap
  * @{
  */
#define SPI_IO_SWAP_DISABLE                           (0x00000000UL)
#define SPI_IO_SWAP_ENABLE                            SPI_CFG2_IOSWP
/**
  * @}
  */

/** @defgroup SPI_Master_SS_Idleness SPI Master SS Ideleness
  * @{
  */
#define SPI_MASTER_SS_IDLENESS_00CYCLE                (0x00000000UL)
#define SPI_MASTER_SS_IDLENESS_01CYCLE                (0x00000001UL)
#define SPI_MASTER_SS_IDLENESS_02CYCLE                (0x00000002UL)
#define SPI_MASTER_SS_IDLENESS_03CYCLE                (0x00000003UL)
#define SPI_MASTER_SS_IDLENESS_04CYCLE                (0x00000004UL)
#define SPI_MASTER_SS_IDLENESS_05CYCLE                (0x00000005UL)
#define SPI_MASTER_SS_IDLENESS_06CYCLE                (0x00000006UL)
#define SPI_MASTER_SS_IDLENESS_07CYCLE                (0x00000007UL)
#define SPI_MASTER_SS_IDLENESS_08CYCLE                (0x00000008UL)
#define SPI_MASTER_SS_IDLENESS_09CYCLE                (0x00000009UL)
#define SPI_MASTER_SS_IDLENESS_10CYCLE                (0x0000000AUL)
#define SPI_MASTER_SS_IDLENESS_11CYCLE                (0x0000000BUL)
#define SPI_MASTER_SS_IDLENESS_12CYCLE                (0x0000000CUL)
#define SPI_MASTER_SS_IDLENESS_13CYCLE                (0x0000000DUL)
#define SPI_MASTER_SS_IDLENESS_14CYCLE                (0x0000000EUL)
#define SPI_MASTER_SS_IDLENESS_15CYCLE                (0x0000000FUL)
/**
  * @}
  */

/** @defgroup SPI_Master_InterData_Idleness SPI Master Inter-Data Ideleness
  * @{
  */
  #define SPI_MASTER_INTERDATA_IDLENESS_00CYCLE         (0x00000000UL)
  #define SPI_MASTER_INTERDATA_IDLENESS_01CYCLE         (0x00000010UL)
  #define SPI_MASTER_INTERDATA_IDLENESS_02CYCLE         (0x00000020UL)
  #define SPI_MASTER_INTERDATA_IDLENESS_03CYCLE         (0x00000030UL)
  #define SPI_MASTER_INTERDATA_IDLENESS_04CYCLE         (0x00000040UL)
  #define SPI_MASTER_INTERDATA_IDLENESS_05CYCLE         (0x00000050UL)
  #define SPI_MASTER_INTERDATA_IDLENESS_06CYCLE         (0x00000060UL)
  #define SPI_MASTER_INTERDATA_IDLENESS_07CYCLE         (0x00000070UL)
  #define SPI_MASTER_INTERDATA_IDLENESS_08CYCLE         (0x00000080UL)
  #define SPI_MASTER_INTERDATA_IDLENESS_09CYCLE         (0x00000090UL)
  #define SPI_MASTER_INTERDATA_IDLENESS_10CYCLE         (0x000000A0UL)
  #define SPI_MASTER_INTERDATA_IDLENESS_11CYCLE         (0x000000B0UL)
  #define SPI_MASTER_INTERDATA_IDLENESS_12CYCLE         (0x000000C0UL)
  #define SPI_MASTER_INTERDATA_IDLENESS_13CYCLE         (0x000000D0UL)
  #define SPI_MASTER_INTERDATA_IDLENESS_14CYCLE         (0x000000E0UL)
  #define SPI_MASTER_INTERDATA_IDLENESS_15CYCLE         (0x000000F0UL)
/**
  * @}
  */

